Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: Translate to English, rephrase to adhere to the Microsoft Style Guide, third person: In tabul Media, in meniul Settings a aparut actiunea Show only keys with closest relative key scope Cand o bifam trebuie sa ramana in view doar cheile relative (cheile cu forma cea mai scurta).
ro: Traduceți în engleză, reformulați pentru a respecta Microsoft Style Guide, persoana a treia: In tabul Media, in meniul Settings a aparut actiunea Show only keys with closest relative key scope Cand o bifam trebuie sa ramana in view doar cheile relative (cheile cu forma cea mai scurta).

source: Re-write an entire DITA XML topic to increase its readability.
ro: Rescrieți un întreg topic DITA XML pentru a-i crește lizibilitatea.

source: Re-write the following DITA XML topic preserving all its original XML elements to increase its readability: <topic id="dita_oriented_tips_and_tricks"> <title>DITA Oriented Tips And Tricks</title> <prolog> <author>Radu Coravu</author> </prolog> <body> <p><ph keyref="oxygen"/> has about 18 years of development under its wings. During these years, we added lots of functionality and many of our users usually do not know more than 20-30% of Oxygen's features. So this presentation is intended for technical writers using Oxygen to write DITA content and who may want to find out more about their tool.</p> <section id="section_gld_tbs_gfb"> <title>Add-ons</title> <p>There are lots of free add-ons provided by the Oxygen team that can be installed in an <xref href="https://github.com/search?q=topic%3Aadd-on+org%3Aoxygenxml&amp;type=Repositories" format="html" scope="external">Oxygen standalone version</xref>. I will enumerate some of the most interesting one:</p> <ul id="ul_xbw_ccs_gfb"> <li><xref href="https://github.com/oxygenxml/oxygen-git-plugin" format="html" scope="external">Git add-on</xref>. This plugin adds a side view allowing you to do some common Git operations like pull, commit, push (mostly 90% of what a regular Git user would do).</li> <li><xref href="https://www.oxygenxml.com/doc/ug-editor/topics/content-fusion-addon.html" format="html" scope="external">Content Fusion Connector add-on</xref>. Collaborate with your peers by sending them links that allow them to give you feedback on your work using a web browser without the need to pre-install anything on their side. </li> </ul> </section> </body> </topic>
ro: Rescrieți următorul topic DITA XML păstrând toate elementele XML originale pentru a-i crește lizibilitatea: <topic id="dita_oriented_tips_and_tricks"> <title>DITA Oriented Tips And Tricks</title> <prolog> <author>Radu Coravu</author> </prolog> <body> <p><ph keyref="oxygen"/> has about 18 years of development under its wings. During these years, we added lots of functionality and many of our users usually do not know more than 20-30% of Oxygen's features. So this presentation is intended for technical writers using Oxygen to write DITA content and who may want to find out more about their tool.</p> <section id="section_gld_tbs_gfb"> <title>Add-ons</title> <p>There are lots of free add-ons provided by the Oxygen team that can be installed in an <xref href="https://github.com/search?q=topic%3Aadd-on+org%3Aoxygenxml&amp;type=Repositories" format="html" scope="external">Oxygen standalone version</xref>. I will enumerate some of the most interesting one:</p> <ul id="ul_xbw_ccs_gfb"> <li><xref href="https://github.com/oxygenxml/oxygen-git-plugin" format="html" scope="external">Git add-on</xref>. This plugin adds a side view allowing you to do some common Git operations like pull, commit, push (mostly 90% of what a regular Git user would do).</li> <li><xref href="https://www.oxygenxml.com/doc/ug-editor/topics/content-fusion-addon.html" format="html" scope="external">Content Fusion Connector add-on</xref>. Collaborate with your peers by sending them links that allow them to give you feedback on your work using a web browser without the need to pre-install anything on their side. </li> </ul> </section> </body> </topic>

source: Result:
ro: Rezultat:

source: Remarks: If the prompt insists that all XML elements should be preserved, the re-write does few things, but if the prompt does not insist that all XML elements should be preserved, the inline elements and links are removed.
ro: Observații: Dacă promptul insistă ca toate elementele XML să fie păstrate, rescrierea face puține modificări, dar dacă promptul nu insistă asupra păstrării tuturor elementelor XML, elementele inline și legăturile sunt eliminate.

source: Statistics
ro: Statistici

source: Create readability analysis for a DITA XML topic.
ro: Creați o analiză a lizibilității pentru un topic DITA XML.

source: Create a readability analysis for the following DITA XML topic: <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE topic PUBLIC "-//OASIS//DTD DITA Topic//EN" "topic.dtd"> <topic id="topic_whr_nly_c5"> <title>Sharing Application Settings</title><prolog><author>Radu Coravu</author></prolog> <body> <p>There are various ways in the <b>Oxygen</b> standalone version through which a team of writers .........
ro: Creați o analiză a lizibilității pentru următorul topic DITA XML: <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE topic PUBLIC "-//OASIS//DTD DITA Topic//EN" "topic.dtd"> <topic id="topic_whr_nly_c5"> <title>Sharing Application Settings</title><prolog><author>Radu Coravu</author></prolog> <body> <p>There are various ways in the <b>Oxygen</b> standalone version through which a team of writers .........

source: Custom Validation (Schematron-based)
ro: Validare personalizată (bazată pe Schematron)

source: Create an ISO Schematron validation check that counts words.
ro: Creați o verificare de validare ISO Schematron care să numere cuvintele.

source: Create an ISO Schematron schema which reports if a DITA short description element has more than 20 words.
ro: Creați o schemă ISO Schematron care raportează dacă un element de descriere scurtă DITA are mai mult de 20 de cuvinte.

source: Remark: The namespace declaration and usage is wrong (DITA elements are in no namespace). The assert test is correct.
ro: Observație: Declarația și utilizarea namespace-ului sunt greșite (elementele DITA nu sunt într-un namespace). Testul assert este corect.

source: Create an ISO Schematron validation check from a description.
ro: Creați o verificare de validare ISO Schematron pornind de la o descriere.

source: Create an ISO Schematron validation rule which reports an error if a DITA XML image element does not contain a scale attribute
ro: Creați o regulă de validare ISO Schematron care raportează o eroare dacă un element imagine DITA XML nu conține atributul scale

source: Practical Steps for Vibe Authoring with AI Positron
ro: Pași practici pentru redactarea Vibe cu AI Positron

source: We initially started work on the AI Positron add-on for Oxygen XML Editor more than 2 years ago by creating useful AI actions to improve readability of content, correct grammar , translate , proofread , and so on. Gradually, we realized that even when invoking our carefully made prompts wrapped as such AI actions, you need flexibility to further discuss the results with the AI. So we added support to create custom AI actions specific to your needs. Such AI actions, based on prompts tuned by your experts (or ours), continue to be useful for precise use cases and for people who are just starting to use AI tools.
ro: Inițial, am început să lucrăm la suplimentul AI Positron pentru Oxygen XML Editor acum mai bine de 2 ani, creând acțiuni AI utile pentru a îmbunătăți lizibilitatea conținutului, a corecta gramatica , a traduce , a corecta și așa mai departe. Treptat, am realizat că, chiar și atunci când invoci prompturi atent create, ambalate ca astfel de acțiuni AI, ai nevoie de flexibilitate pentru a discuta în continuare rezultatele cu AI-ul. Astfel, am adăugat suport pentru crearea de acțiuni AI personalizate, specifice nevoilor tale. Aceste acțiuni AI, bazate pe prompturi ajustate de experții tăi (sau de ai noștri), continuă să fie utile pentru cazuri de utilizare precise și pentru persoanele care abia încep să folosească instrumente AI.

source: In time, we also started to explore and expand the capabilities of using chat to converse with the AI, attach all sorts of file types ( PDF , Word , Markdown , images) to create documentation drafts , explore , and make changes in the current project.
ro: În timp, am început să explorăm și să extindem capabilitățile de a folosi chat-ul pentru a conversa cu AI-ul, de a atașa tot felul de tipuri de fișiere ( PDF , Word , Markdown , imagini) pentru a crea schițe de documentație , a explora și a efectua modificări în proiectul curent.

source: The chat view in any AI Assistant application like AI Positron is the new console ; you use it to direct the AI, affect changes , preview them, and refine until you have a working draft. You remain in control of a powerful and imperfect tool. As before, in the past, computers have moved writing and coding to a higher level of abstraction.
ro: Vizualizarea de chat din orice aplicație AI Assistant , precum AI Positron , este noua consolă ; o folosești pentru a dirija AI-ul, a produce modificări , a le previzualiza și a rafina până obții o schiță funcțională. Rămâi în controlul unui instrument puternic și imperfect . Așa cum, în trecut, computerele au ridicat scrierea și programarea la un nivel superior de abstractizare.

source: I would define the Vibe Authoring support in the AI Positron add-on as a feature that allows you to:
ro: Aș defini suportul Vibe Authoring din suplimentul AI Positron ca o funcționalitate care îți permite să:

source: Define a project context prompt that gives the AI models general information about your project, important style guide, terminology, and structure rules.
ro: Definești un prompt de context de proiect care oferă modelelor AI informații generale despre proiectul tău, reguli importante de stil, terminologie și structură.

source: Chat with the AI to explore the current project's contents or to affect changes in the project. All changes made by the AI can be viewed and reverted , if necessary.
ro: Conversezi cu AI-ul pentru a explora conținutul proiectului curent sau pentru a efectua modificări în proiect. Toate modificările realizate de AI pot fi vizualizate și revenite , dacă este necesar.

source: Connect Model Context Protocol servers to provide tools that integrate AI Positron with other data sources in your company (for example, ticketing system, issues list, etc.).
ro: Conectezi servere Model Context Protocol pentru a oferi instrumente care integrează AI Positron cu alte surse de date din compania ta (de exemplu, sistem de tichete, listă de probleme etc.).

source: Novice to Expert
ro: De la începător la expert

source: If one were to attempt to divide people into novices and experts, they would soon figure out that each of us is a novice in certain fields and an expert in others.
ro: Dacă cineva ar încerca să împartă oamenii în începători și experți, ar descoperi rapid că fiecare dintre noi este începător în anumite domenii și expert în altele.

source: As novices, we use out-of-the-box tools and frameworks with a minimum of customization to obtain poor results. We cannot explain either when the tool does not work or when it does. When we do not obtain quality content as novices, we blame the tools.
ro: Ca începători, folosim instrumente și framework-uri standard, cu o personalizare minimă, pentru a obține rezultate slabe. Nu putem explica nici când instrumentul nu funcționează, nici când funcționează. Când nu obținem conținut de calitate ca începători, dăm vina pe instrumente.

source: In time, by reading , writing , and making mistakes , we evolve to understand the tools and frameworks we use. Taking some time to understand these tools and to customize them gives us better and more consistent results.
ro: În timp, prin lectură , scriere și greșeli , evoluăm pentru a înțelege instrumentele și framework-urile pe care le folosim. Acordând timp pentru a le înțelege și a le personaliza, obținem rezultate mai bune și mai consistente.

source: This article is an attempt to give you a better understanding of how the Oxygen XML Editor AI Positron add-on works and how it can be customized to maximize the quality of your vibe authoring interactions.
ro: Acest articol este o încercare de a vă oferi o mai bună înțelegere a modului în care funcționează suplimentul Oxygen XML Editor AI Positron și cum poate fi personalizat pentru a maximiza calitatea interacțiunilor de tip vibe authoring.

source: I am not of the opinion that we must consider using AI tools for all of our daily work; our brains need the effort and work we put into writing to better understand the task at hand. There are still many activities that can be accomplished more quickly and with sufficient quality (generating drafts, improving content quality) by using AI tools in a controlled manner.
ro: Nu consider că trebuie să folosim instrumente AI pentru toate activitățile zilnice; creierul nostru are nevoie de efortul și munca pe care le depunem în scriere pentru a înțelege mai bine sarcina de rezolvat. Totuși, există multe activități care pot fi realizate mai rapid și cu o calitate suficientă (generarea de schițe, îmbunătățirea calității conținutului) folosind instrumente AI într-un mod controlat.

source: Use a Version Control System
ro: Folosiți un sistem de control al versiunilor

source: Sometimes, you need to view and revert changes made by the AI , to keep a history of past changes in your project. You also need to collaboratively work with other people or with AI agents , create separate branches for working on features, keep your content secure , and eventually publish it.
ro: Uneori, este nevoie să vizualizați și să reveniți la modificările realizate de AI , pentru a păstra un istoric al modificărilor anterioare din proiect. De asemenea, trebuie să colaborați cu alți oameni sau cu agenți AI, să creați ramuri separate pentru dezvoltarea de funcționalități, să vă păstrați conținutul sigur și, în final, să îl publicați .

source: So a version control system for your project, like Git or a commercial CCMS , is a must .
ro: Prin urmare, un sistem de control al versiunilor pentru proiectul dumneavoastră, precum Git sau un CCMS comercial, este obligatoriu .

source: Oxygen XML Editor 's free Git client add-on is a great tool that gives technical documentation writers just about every feature needed to work with Git projects: support to pull, make changes, preview them, push, a useful History side view, switch branches, and stash changes.
ro: Suplimentul gratuit Git client add-on din Oxygen XML Editor este un instrument excelent care oferă creatorilor de documentație tehnică aproape toate funcționalitățile necesare pentru a lucra cu proiecte Git: suport pentru pull, efectuarea de modificări, previzualizarea acestora, push, o vizualizare laterală utilă History , schimbarea ramurilor și stocarea temporară a modificărilor.

source: Using Git For Technical Writing
ro: Utilizarea Git pentru redactare tehnică

source: Set up Your Project Context Prompt
ro: Configurați promptul de context al proiectului

source: LLM Models have a limited context window and start out not knowing anything about the intricacies of your current documentation project. They can use tools to explore your project's structure, but it's more efficient to create a project context prompt , which becomes part of each invoked AI action and chat conversation.
ro: Modelele LLM au o fereastră de context limitată și, inițial, nu cunosc nimic despre particularitățile proiectului dumneavoastră de documentație. Ele pot folosi instrumente pentru a explora structura proiectului, dar este mai eficient să creați un prompt de context de proiect , care devine parte a fiecărei acțiuni AI invocate și a fiecărei conversații de chat.

source: The project context prompt contains an overview of your project's intention, structure, rules, and style guide. It must be kept as short and informative as possible. In the AI Positron Preferences page, you can specify the entire project context prompt either directly or referenced as a separate file that may reside in your project.
ro: Promptul de context al proiectului conține o prezentare generală a intenției, structurii, regulilor și ghidului de stil al proiectului. Trebuie să fie cât mai scurt și informativ posibil. În pagina AI Positron Preferences , puteți specifica întregul prompt de context al proiectului fie direct, fie ca referință către un fișier separat care poate fi stocat în proiect.

source: The most recent AI Positron release added a new AI action named Generate agent instructions that can help you create the initial project context prompt content.
ro: Cea mai recentă versiune AI Positron a adăugat o nouă acțiune AI numită Generate agent instructions , care vă poate ajuta să creați conținutul inițial al promptului de context de proiect.

source: Examples of project context prompt files for AI Positron in Markdown format:
ro: Exemple de fișiere de prompt de context de proiect pentru AI Positron în format Markdown:

source: Manually created sample context prompt which defines a project's intention, audience, most important terminology rules, style guide, and DITA vocabulary specialization.
ro: Exemplu de prompt de context creat manual, care definește intenția proiectului, publicul țintă, cele mai importante reguli de terminologie, ghidul de stil și specializarea vocabularului DITA.

source: The Oxygen XML Blog's Context Prompt generated using AI.
ro: Promptul de context generat cu AI pentru Oxygen XML Blog.

source: Choose your LLM Model
ro: Alegeți modelul LLM

source: You need a quality LLM model to make quality changes. An LLM model that is efficient, cost-effective, and has a high context window. From our extensive testing and experience, we generally recommend OpenAI GPT 4.1 , Claude Sonet 4 , Haiku 4.5 , or Gemini 2.5 Flash .
ro: Aveți nevoie de un model LLM de calitate pentru a obține modificări de calitate. Un model LLM eficient, rentabil și cu o fereastră de context mare. Din testele și experiența noastră extinsă, recomandăm în general OpenAI GPT 4.1 , Claude Sonet 4 , Haiku 4.5 sau Gemini 2.5 Flash .

source: Context is the key here. The LLM receives a project context prompt, but it also needs to explore the project, read content, and make changes. So your LLM implementation and the platform through which you access it also need to allow tool calling . Most quality LLM models like the ones above also have vision support to read images and create, for example, documentation drafts based on screenshots or to generate alternate text for screenshots in the user's guide.
ro: Contextul este cheia aici. LLM-ul primește un prompt de context de proiect, dar are nevoie și să exploreze proiectul, să citească conținut și să efectueze modificări. Astfel, implementarea LLM-ului și platforma prin care îl accesați trebuie să permită și apelarea de instrumente . Majoritatea modelelor LLM de calitate, precum cele menționate mai sus, au și suport vision pentru a citi imagini și a crea, de exemplu, schițe de documentație pe baza capturilor de ecran sau pentru a genera texte alternative pentru capturile de ecran din ghidul utilizatorului.

source: Choose the Chat Mode
ro: Alegeți modul de chat

source: AI Positron comes with three predefined chat modes:
ro: AI Positron vine cu trei moduri de chat predefinite:

source: DITA Agent - Agentic mode that makes changes in a DITA XML project, comes with a predefined system prompt that instructs the LLM about the base requirements of working in a DITA XML project and a minimal style guide of rules. It has access to general tools to explore the project and make changes, but also to DITA XML-specific tools to obtain the structure of the DITA map opened in the DITA Maps Manager view, resolve a content reference to the referenced content, or to find key definitions that match a specific product name. For example, you can run prompts like this in the chat view:
ro: DITA Agent – Mod agentic care efectuează modificări într-un proiect DITA XML, având un prompt de sistem predefinit care instruiește LLM-ul cu privire la cerințele de bază pentru lucrul într-un proiect DITA XML și un ghid de stil minimal. Are acces la instrumente generale pentru a explora proiectul și a efectua modificări, dar și la instrumente specifice DITA XML pentru a obține structura DITA map-ului deschis în vizualizarea DITA Maps Manager , a rezolva o referință de conținut către conținutul referit sau a găsi definiții de chei care corespund unui anumit nume de produs. De exemplu, puteți rula prompturi ca acesta în chat:

source: Replace in the current file all product names with defined key references
ro: Înlocuiește în fișierul curent toate numele de produse cu referințele de chei definite

source: or:
ro: sau:

source: Use the attached documents to create a DITA XML topic, add related links in the topic to similar ones, find a good place and insert it in the DITA Map
ro: Folosește documentele atașate pentru a crea un topic DITA XML, adaugă legături conexe în topic către altele similare, găsește un loc potrivit și inserează-l în DITA Map

source: Example: Create a new DITA XML topic from a PDF document
ro: Exemplu: Creează un topic DITA XML nou dintr-un document PDF

source: Add related links in the current topic to similar topics from the project
ro: Adaugă legături conexe în topicul curent către topicuri similare din proiect

source: Example: Add related links to topic
ro: Exemplu: Adaugă legături conexe la topic

source: Agent - Generic agent useful for exploring and making changes to a variety of projects.
ro: Agent – Agent generic util pentru explorarea și modificarea diverselor tipuri de proiecte.

source: Ask - Read-only agent useful for exploring and integrating plans without making actual changes until you switch to one of the other agents.
ro: Ask – Agent doar pentru citire, util pentru explorare și integrarea planurilor fără a face modificări reale până când treceți la unul dintre ceilalți agenți.

source: Each defined agent has a system prompt and references a set of tools that can be used by the LLM. You can define your own agents and have them appear in the Chat view. A general overview of the tools available to these agentic chat modes is available below.
ro: Fiecare agent definit are un prompt de sistem și face referire la un set de instrumente care pot fi folosite de LLM. Puteți defini propriii agenți și îi puteți face să apară în vizualizarea de Chat . O prezentare generală a instrumentelor disponibile pentru aceste moduri de chat agentic este disponibilă mai jos.

source: General Overview of Available Tools
ro: Prezentare generală a instrumentelor disponibile

source: AI Positron comes bundled with a variety of tools that are offered to the LLM to explore and make changes to content. Here are some of the categories of available tools along with prompts you can test for yourself in the AI Positron chat view:
ro: AI Positron vine la pachet cu o varietate de instrumente puse la dispoziția LLM-ului pentru a explora și modifica conținutul. Iată câteva dintre categoriile de instrumente disponibile, împreună cu prompturi pe care le puteți testa în vizualizarea de chat AI Positron :

source: Tools to explore the overall project. The chat modes have access to:
ro: Instrumente pentru explorarea proiectului în ansamblu. Modurile de chat au acces la:

source: Tool that can perform keyword search in the project. For example, you can ask it:
ro: Instrument care poate efectua căutări după cuvinte cheie în proiect. De exemplu, îi puteți cere:
